app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'teacher'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
---
    public function dashboard()
    {
        // Vérifier que l'utilisateur est connecté en tant qu'admin
        if (!session()->get('isLoggedIn') || session()->get('user_role') !== 'admin') {
            return redirect()->to('admin/login')->with('error', 'Veuillez vous connecter en tant qu\'administrateur.');
        }

        // Récupérer les statistiques avec gestion d'erreur complète
        $stats = [
            'total_users' => 0,
            'total_teachers' => 0,
            'total_students' => 0,
            'total_courses' => 0,
            'pending_grades' => 0,
            'active_schedules' => 0
        ];

        try {
            $stats['total_users'] = $this->userModel->countAll();
            $stats['total_teachers'] = $this->userModel->where('role', 'teacher')->countAllResults();
            $stats['total_students'] = $this->userModel->where('role', 'student')->countAllResults();