app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'brunodandogbessi@gmail.com'
 LIMIT 1
---
    public function process_login()
    {
        // Validation des données
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $remember = $this->request->getPost('remember');

        // Authentification de l'utilisateur
        $user = $this->userModel->where('email', $email)->first();

INSERT INTO `users` (`first_name`, `last_name`, `email`, `password`, `role`, `institution`, `avatar`, `is_active`, `email_verified`, `created_at`, `updated_at`) VALUES ('Bruno', 'DANDOGBESSI', 'brunodandogbessi@gmail.com', '$2y$10$LSGiJiZZOhfbw6fkL5w7VuvV6mnpDDtwKVOadoIsAjiXARkQ4RnKy', 'teacher', 'ENSGMM-Abomey', 'https://ui-avatars.com/api/?name=Bruno%2BDANDOGBESSI&background=667eea&color=fff', 1, 0, '2025-11-06 03:22:17', '2025-11-06 03:22:17')
---
        ];

        // Insertion dans la base de données
        if ($this->userModel->insert($userData)) {

UPDATE `users` SET `remember_token` = NULL, `remember_expires` = NULL
WHERE `users`.`id` IN ('5')
---
    private function clearRememberMeToken($userId)
    {
        $this->userModel->update($userId, [
            'remember_token' => null,
            'remember_expires' => null
        ]);