app/Controllers/BaseController.php

UPDATE `users` SET `remember_token` = '239fd2217e1d031477245e156bd9404df821e3f2ab979d02931020e3010410a3', `remember_expires` = '2025-12-06 03:22:36'
WHERE `users`.`id` IN ('5')
---
    protected function setRememberMeToken($userId)
    {
        try {
            $token = bin2hex(random_bytes(32));
            $expire = time() + (30 * 24 * 60 * 60); // 30 jours

            $this->userModel->update($userId, [
                'remember_token' => $token,
                'remember_expires' => date('Y-m-d H:i:s', $expire)
            ]);