app/Models/UserModel.php

    public function updateLastAccess($userId)
    {
        return $this->update($userId, [
            'last_access' => date('Y-m-d H:i:s')
        ]);
---
UPDATE `users` SET `last_access` = '2025-11-06 03:14:56'
WHERE `users`.`id` IN ('1')